//Напишите программу, которая на вход
//принимает число и выдаёт его квадрат (число
//умноженное на само себя).

Console.Write("Введите число :");
int number = Convert.ToInt32(Console.ReadLine());

Console.Write("Квадрат числа :");
Console.WriteLine(number * number);